zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4hvms128k_32_qfn.h
    /* P1.5 */
    P1_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_5_MSC0_SENSE                 =  4,       /* msc[0].sense:15 */
    P1_5_MSC0_SHIELD                =  5,       /* msc[0].shield:15 */
    P1_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_5_PERI_VIRT_IN_1             =  8,       /* Digital Active - peri.virt_in_1 */
    P1_5_SCB1_UART_RTS              = 10,       /* Digital Active - scb[1].uart_rts:0 */
    P1_5_TCPWM_LINE3                = 11,       /* Digital Active - tcpwm.line[3]:1 */
    P1_5_SCB0_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[0].spi_clk:1 */
    P1_5_CPUSS_SWD_DATA             = 14,       /* Digital Deep Sleep - cpuss.swd_data */
    P1_5_LPCOMP_COMP0               = 15,       /* Digital Deep Sleep - lpcomp.comp[0]:1 */

    /* P3.0 */
    P3_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_0_MSC0_SENSE                 =  4,       /* msc[0].sense:18 */
    P3_0_MSC0_SHIELD                =  5,       /* msc[0].shield:18 */
    P3_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_0_MSC0_OBS_DATA0             =  8,       /* Digital Active - msc[0].obs_data[0] */
    P3_0_PASS0_DSI_SAR_DATA1        = 10,       /* Digital Active - pass[0].dsi_sar_data[1] */
    P3_0_TCPWM_LINE_COMPL4          = 11,       /* Digital Active - tcpwm.line_compl[4]:0 */
    P3_0_SCB0_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[0].spi_miso:1 */
    P3_0_LPCOMP_COMP1               = 15,       /* Digital Deep Sleep - lpcomp.comp[1]:1 */

    /* P4.0 */
    P4_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_0_MSC0_SENSE                 =  4,       /* msc[0].sense:45 */
    P4_0_MSC0_SHIELD                =  5,       /* msc[0].shield:45 */
    P4_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_0_CXPI_CXPI_RX0              =  8,       /* Digital Active - cxpi.cxpi_rx[0]:0 */
    P4_0_SCB0_UART_RX               = 10,       /* Digital Active - scb[0].uart_rx:1 */
    P4_0_TCPWM_LINE4                = 11,       /* Digital Active - tcpwm.line[4]:2 */
    P4_0_SCB2_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[2].spi_clk */

    /* P4.1 */
    P4_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_1_MSC0_SENSE                 =  4,       /* msc[0].sense:44 */
    P4_1_MSC0_SHIELD                =  5,       /* msc[0].shield:44 */
    P4_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_1_CXPI_CXPI_TX0              =  8,       /* Digital Active - cxpi.cxpi_tx[0]:0 */
    P4_1_SCB0_UART_TX               = 10,       /* Digital Active - scb[0].uart_tx:1 */
    P4_1_TCPWM_LINE_COMPL4          = 11,       /* Digital Active - tcpwm.line_compl[4]:2 */
    P4_1_SCB2_SPI_MOSI              = 12,       /* Digital Deep Sleep - scb[2].spi_mosi */

    /* P4.2 */
    P4_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_2_MSC0_SENSE                 =  4,       /* msc[0].sense:43 */
    P4_2_MSC0_SHIELD                =  5,       /* msc[0].shield:43 */
    P4_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_2_CXPI_CXPI_EN0              =  8,       /* Digital Active - cxpi.cxpi_en[0]:0 */
    P4_2_SCB0_UART_RTS              = 10,       /* Digital Active - scb[0].uart_rts:1 */
    P4_2_TCPWM_LINE0                = 11,       /* Digital Active - tcpwm.line[0]:1 */
    P4_2_SCB2_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[2].spi_miso */

    /* P5.0 */
    P5_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_0_MSC0_SENSE                 =  4,       /* msc[0].sense:2 */
    P5_0_MSC0_SHIELD                =  5,       /* msc[0].shield:2 */
    P5_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_0_CXPI_CXPI_TX0              =  8,       /* Digital Active - cxpi.cxpi_tx[0]:1 */
    P5_0_LIN_LIN_TX0                =  9,       /* Digital Active - lin.lin_tx[0]:1 */
    P5_0_SCB1_UART_TX               = 10,       /* Digital Active - scb[1].uart_tx:1 */
    P5_0_TCPWM_LINE_COMPL0          = 11,       /* Digital Active - tcpwm.line_compl[0]:2 */
    P5_0_SCB1_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[1].spi_miso:0 */
    P5_0_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:1 */
    P5_0_LPCOMP_COMP0               = 15,       /* Digital Deep Sleep - lpcomp.comp[0]:0 */

    /* P5.1 */
    P5_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_1_MSC0_SENSE                 =  4,       /* msc[0].sense:3 */
    P5_1_MSC0_SHIELD                =  5,       /* msc[0].shield:3 */
    P5_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_1_CXPI_CXPI_RX0              =  8,       /* Digital Active - cxpi.cxpi_rx[0]:1 */
    P5_1_LIN_LIN_RX0                =  9,       /* Digital Active - lin.lin_rx[0]:1 */
    P5_1_SCB1_UART_RX               = 10,       /* Digital Active - scb[1].uart_rx:1 */
    P5_1_TCPWM_LINE0                = 11,       /* Digital Active - tcpwm.line[0]:2 */
    P5_1_SCB1_SPI_MOSI              = 12,       /* Digital Deep Sleep - scb[1].spi_mosi:0 */
    P5_1_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:1 */
    P5_1_LPCOMP_COMP1               = 15,       /* Digital Deep Sleep - lpcomp.comp[1]:0 */

    /* P7.0 */
    P7_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_0_MSC0_SENSE                 =  4,       /* msc[0].sense:0 */
    P7_0_MSC0_SHIELD                =  5,       /* msc[0].shield:0 */
    P7_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_0_PASS0_DSI_CTB_CMP0         = 13,       /* Digital Deep Sleep - pass[0].dsi_ctb_cmp0 */

    /* P7.1 */
    P7_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_1_MSC0_SENSE                 =  4,       /* msc[0].sense:1 */
    P7_1_MSC0_SHIELD                =  5,       /* msc[0].shield:1 */
    P7_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_1_PASS0_DSI_CTB_CMP1         = 13        /* Digital Deep Sleep - pass[0].dsi_ctb_cmp1 */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC4HVMS128K_32_QFN_H_ */


/* [] END OF FILE */
